In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

In [2]:
countries = pd.read_csv('StackOverflowDeveloperSurvey.csv', usecols=['Country']).squeeze().dropna()
countries.head()

0     United States
1    United Kingdom
2    United Kingdom
3     United States
4       Switzerland
Name: Country, dtype: object

In [3]:
countries[countries == 'Spain']

69       Spain
116      Spain
201      Spain
301      Spain
334      Spain
         ...
51060    Spain
51156    Spain
51222    Spain
51333    Spain
51367    Spain
Name: Country, Length: 864, dtype: object

In [4]:
'Spain' in countries

False

In [5]:
'Spain' in countries.values

True

In [6]:
'Wonderland' in countries.values

False